"+ Add" = "+ Dodaj";

"Add a card" = "Dodaj kartę";

"Add a payment method" = "Dodaj metodę płatności";

"Add bank account" = "Dodaj rachunek bankowy";

"Add new payment method" = "Dodaj nową metodę płatności";

"Add your payment information" = "Dodaj informacje o płatności";

"Approve payment" = "Zatwierdź płatność";

"Are you sure you want to remove this card?" = "Czy na pewno chcesz usunąć tę kartę?";

"Are you sure you want to remove this linked account?" = "Czy na pewno chcesz usunąć to połączone konto?";

"Back" = "Wstecz";

"Bank account" = "Konto bankowe";

"Buy now or pay later with Klarna." = "Kup teraz lub zapłać za pomocą Klarna później.";

"Buy using a UPI ID" = "Kup za pomocą UPI ID";

"By confirming your payment with PayPal, you allow %@ to charge your PayPal account for future payments in accordance with their terms." = "Zatwierdzając płatność z PayPal, zezwalasz %@ na obciążenie Twojego konta PayPal przyszłymi płatnościami zgodnie z ich warunkami.";

"By continuing to PayPal, you allow %@ to charge your PayPal account for future payments in accordance with their terms." = "Przechodząc do PayPal, zezwalasz %@ na obciążenie Twojego konta PayPal przyszłymi płatnościami zgodnie z ich warunkami.";

"By continuing, you agree to authorize payments pursuant to <terms>these terms</terms>." = "Kontynuując, wyrażasz zgodę na autoryzowanie płatności zgodnie z <terms>tymi warunkami</terms>.";

"By continuing, you agree to authorize payments pursuant to these <terms>terms</terms>." = "Kontynuując, wyrażasz zgodę na autoryzowanie płatności zgodnie z tymi <terms>warunkami</terms>.";

"By continuing, you authorize %@ to debit your Cash App account for this payment and future payments in accordance with %@'s terms, until this authorization is revoked. You can change this anytime in your Cash App Settings." = "Kontynuując, wyrażasz zgodę na obciążenie przez %1$@ Twojego konta Cash App kwotą tej płatności oraz przyszłych płatności zgodnie z warunkami %2$@ do momentu wycofania zgody. To ustawienie można zmienić w dowolnym momencie w ustawieniach Cash App.";

"By joining Link, you agree to the <terms>Terms</terms> and <privacy>Privacy Policy</privacy>." = "Dołączając do Link, wyrażasz zgodę na <terms>Warunki</terms> i <privacy>Politykę prywatności</privacy>.";

"By providing your payment information and confirming this payment, you authorise (A) %@ and Stripe, our payment service provider, to send instructions to your bank to debit your account and (B) your bank to debit your account in accordance with those instructions. As part of your rights, you are entitled to a refund from your bank under the terms and conditions of your agreement with your bank. A refund must be claimed within 8 weeks starting from the date on which your account was debited. Your rights are explained in a statement that you can obtain from your bank. You agree to receive notifications for future debits up to 2 days before they occur." = "Podając dane płatności i potwierdzając tę płatność, upoważniasz (A) %@ i Stripe, naszego dostawcę usług płatności, do wysłania instrukcji do Twojego banku w celu obciążenia Twojego konta oraz (B) Twój bank do obciążenia Twojego konta zgodnie z tymi instrukcjami. W ramach swoich praw jesteś uprawniony(-a) do otrzymania zwrotu od Twojego banku zgodnie z zasadami i warunkami umowy z bankiem. Zwrot należy odebrać w ciągu 8 tygodni, licząc od daty obciążenia konta. Twoje prawa są wyjaśnione w oświadczeniu, które możesz otrzymać z banku. Wyrażasz zgodę na otrzymywanie powiadomień w przypadku przyszłych obciążeń do 2 dni przed ich wystąpieniem.";

"By saving your bank account for %@ you agree to authorize payments pursuant to <terms>these terms</terms>." = "Zapisując swoje konto bankowe dla %@, zgadzasz się na autoryzowanie płatności zgodnie z <terms>tymi warunkami</terms>.";

"Cancel and pay another way" = "Anuluj i skorzystaj z innej metody zapłaty";

"Change email" = "Zmień e-mail";

"Choose a payment method" = "Wybierz metodę płatności";

"Close card scanner" = "Zamknij skaner karty";

"Code sent" = "Kod wysłany";

"Contact information" = "Dane kontaktowe";

"Default" = "Domyślne";

"EPS Bank" = "Bank EPS";

"Enter address manually" = "Wprowadź adres ręcznie";

"Enter the code sent to %@ to use Link to pay by default." = "Wprowadź kod wysłany na adres %@, aby domyślnie używać Link do płatności.";

"Enter your verification code" = "Wprowadź kod weryfikacyjny";

"For security, please re-enter your card’s security code." = "Ze względów bezpieczeństwa wprowadź ponownie kod bezpieczeństwa Twojej karty.";

"IBAN" = "IBAN";

"Join Link" = "Dołącz do Link";

"Log out of Link" = "Wyloguj się z Link";

"Name on card" = "Imię i nazwisko na karcie";

"Not %@?" = "Nie jesteś %@?";

"Open your UPI app to approve your payment within %@" = "Otwórz aplikację UPI, aby zatwierdzić płatność w %@";

"Or" = "Lub";

"Or pay using" = "Lub zapłać, korzystając z";

"Or pay with a card" = "Lub zapłać kartą";

"Pay %@" = "Zapłać %@";

"Pay another way" = "Zapłać w inny sposób";

"Pay faster at %@ and thousands of merchants." = "Płać szybciej w %@ i u tysięcy sprzedawców.";

"Pay in <num_installments/> interest-free payments of <installment_price/> with <img/>" = "Zapłacić w <num_installments/> nieoprocentowanych ratach <installment_price/> z <img/>";

"Pay later with Klarna." = "Zapłać później za pomocą Klarna.";

"Pay over time with %@" = "Zapłać później, korzystając z %@";

"Pay using" = "Zapłać, korzystając z";

"Pay with %@" = "Zapłać z wykorzystaniem metody %@";

"Pay with your bank account in just a few steps." = "Zapłać za pomocą konta bankowego w kilku krokach.";

"Payment" = "Płatność";

"Payment failed" = "Płatność się nie powiodła";

"Payment methods" = "Metody płatności";

"Please go back and select another payment method" = "Wróć i wybierz inną metodę płatności";

"Point the camera at your card." = "Skieruj aparat na kartę.";

"Processing..." = "Przetwarzanie…";

"Przelewy24 Bank" = "Przelewy24 Bank";

"Remove %1$@ ending in %2$@" = "Usuń kartę %1$@, której numer kończy się cyframi %2$@";

"Remove Card" = "Usuń kartę";

"Remove card" = "Usuń kartę";

"Remove linked account" = "Usuń podłączone konto";

"Resend code" = "Wyślij kod ponownie";

"Save address" = "Zapisz adres";

"Save for future payments" = "Zapisz do przyszłych płatności";

"Save my info for secure 1-click checkout" = "Zapisz moje informacje do bezpiecznej finalizacji jednym kliknięciem";

"Save this account for future %@ payments" = "Zapisz to konto do przyszłych płatności %@";

"Save this card for future %@ payments" = "Zapisz dane tej karty do przyszłych płatności %@";

"Secure 1⁠-⁠click checkout" = "Bezpieczna finalizacja jednym kliknięciem";

"Select your payment method" = "Wybierz metodę płatności";

"Set as default" = "Ustaw jako domyślną";

"Set as default payment method" = "Użyj jako domyślnej metody płatności";

"Set up" = "Ustaw";

"Shipping to %@ is not supported." = "Wysyłka do lokalizacji: %@ nie jest obsługiwana";

"Show menu" = "Pokaż menu";

"Sign in to your Link account" = "Zaloguj się na konto Link";

"Stripe will deposit $0.01 to your account in 1-2 business days. Then you’ll get an email with instructions to complete payment to %@." = "Stripe wpłaci 0,01 USD na Twoje konto w ciągu 1-2 dni roboczych. Następnie otrzymasz wiadomość e-mail z instrukcjami dotyczącymi zakończenia płatności na rzecz %@.";

"Tap to close" = "Dotknij, aby zamknąć";

"Tap to expand" = "Dotknij, aby rozwinąć";

"The IBAN you entered is incomplete." = "Podany IBAN jest niepełny.";

"The provided verification code has expired." = "Podany kod weryfikacyjny jest nieaktualny.";

"The provided verification code is incorrect." = "Podany kod weryfikacyjny jest nieprawidłowy.";

"This card has expired. Update your card info or choose a different payment method." = "Termin ważności tej karty minął. Zaktualizuj informacje o karcie lub wybierz inną metodę płatności.";

"This is your default" = "To Twoje ustawienie domyślne";

"Too many attempts. Please try again in a few minutes." = "Zbyt wiele prób. Spróbuj ponownie za kilka minut.";

"Unavailable for this purchase" = "Niedostępne dla tego zakupu";

"Update card" = "Zaktualizuj kartę";

"Use your saved info to check out faster" = "Użyj zapisanych danych, aby szybciej zakończyć operację.";

"Your IBAN should start with a two-letter country code." = "IBAN powinien się zaczynać od dwuliterowego kodu kraju.";

"iDEAL Bank" = "iDEAL Bank";
